import type { TemperamentId, TypeResult } from "../../../shared/types/typer";

export const TYPE_RESULTS: Record<TemperamentId, Record<string, TypeResult>> = {
  flexible: {
    "ЧИ+БЛ": { c: "ИЛЭ", n: "Дон Кихот" },
    "ЧИ+БЭ": { c: "ИЭЭ", n: "Гексли" },
    "ЧС+БЛ": { c: "СЛЭ", n: "Жуков" },
    "ЧС+БЭ": { c: "СЭЭ", n: "Наполеон" },
  },
  adaptive: {
    "БС+ЧЭ": { c: "СЭИ", n: "Дюма" },
    "БС+ЧЛ": { c: "СЛИ", n: "Габен" },
    "БИ+ЧЭ": { c: "ИЭИ", n: "Есенин" },
    "БИ+ЧЛ": { c: "ИЛИ", n: "Бальзак" },
  },
  linear: {
    "ЧЭ+БС": { c: "ЭСЭ", n: "Гюго" },
    "ЧЭ+БИ": { c: "ЭИЭ", n: "Гамлет" },
    "ЧЛ+БС": { c: "ЛСЭ", n: "Штирлиц" },
    "ЧЛ+БИ": { c: "ЛИЭ", n: "Джек Лондон" },
  },
  stable: {
    "БЛ+ЧИ": { c: "ЛИИ", n: "Робеспьер" },
    "БЛ+ЧС": { c: "ЛСИ", n: "Максим Горький" },
    "БЭ+ЧИ": { c: "ЭИИ", n: "Достоевский" },
    "БЭ+ЧС": { c: "ЭСИ", n: "Драйзер" },
  },
};
